In [2]:
import numpy as np
import pandas as pd

In [16]:
#dataframe has both rows and columns. It can be though of as a dictionary of series
#all sharing the same index

data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
 "year": [2000, 2001, 2002, 2001, 2002, 2003],
 "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
# it is very important that the leght of lists should be equal
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [17]:
#if the number of rows are large and we want to select only first 5 rows
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [18]:
#Similarly tail return last 5 rows
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [20]:
#now, we want the columns as per our arrangement
pd.DataFrame(data, columns=["year","state","pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [30]:
#we can add extra column that is not present in the dict and its value will be NaN
frame2 = pd.DataFrame(data, columns=["year","state","pop","debt"])

In [31]:
#If we require only state column
frame["state"]
frame.state
#the above two will give the same output

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [27]:
#rows cn be trieved using loc and iloc
frame.loc[0] # it gives all the values in row 1
frame.loc[1] # it gives all the values in row 2

state    Ohio
year     2001
pop       1.7
Name: 1, dtype: object

In [28]:
frame.iloc[1]
#as you can see from the output loc an diloc retuns the same value

state    Ohio
year     2001
pop       1.7
Name: 1, dtype: object

In [32]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [35]:
#frame2["debt"] = 16.5
frame2.debt = 16.5
# the above 2 give the same value
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [38]:
del frame2["debt"]
#it will delete the debt column

In [41]:
#data from nested dictionary
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
"Nevada": {2001: 2.4, 2002: 2.9}}
#outer key will act as column and inner key as row
frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [42]:
#transpose rows to colums
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [43]:
#so they inner keys which are in the row form the index. This isn't true if explicit
#index is specified
pd.DataFrame(populations, index=[2001,2002,2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [45]:
#in dataframe also name attribute can be assigned to rows and columns
frame3.index.name = "year"
frame3.columns.name = "state"
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9